Revit 2024 API
BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcement Property
 Can't find a host for Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlacePathReininforcement { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlacePathReininforcement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlacePathReininforcement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace